DataProcessors/ТелеграмИИОбработкаСообщенийГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмИИОбработкаСообщенийГруппы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТелеграмОбработкаСообщенийИИАктивные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмОбработкаСообщенийИИАктивные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасположениеПроцедуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеПроцедуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмГруппыСообщенийСостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмГруппыСообщенийСостояние</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Открыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмГруппаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмГруппыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Настройки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТелеграмИИОбработкаСообщенийГруппы/Ext/ObjectModule.bsl
Процедура ПроцедураДляВызова(СсылкаДокВхСообщение) Экспорт
	
	ПозицияАдресаБота = СтрНайти(СсылкаДокВхСообщение.Текст, ТелеграмМодуль.ПолучитьАдресТелеграмБота());
	Если ПозицияАдресаБота > 0 Тогда
		ТекстСообщения = Лев(СсылкаДокВхСообщение.Текст, ПозицияАдресаБота-1);
	Иначе
		ТекстСообщения = СсылкаДокВхСообщение.Текст;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ТелеграмОбработкаСообщенийИИАктивные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.РасположениеПроцедуры <> "Обработки.ТелеграмИИОбработкаСообщенийГруппы" или МенеджерЗаписи.НазваниеПроцедуры <> "ПроцедураДляВызова"  Тогда
		//Это первая итерация
		МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
		МенеджерЗаписи.РасположениеПроцедуры = "Обработки.ТелеграмИИОбработкаСообщенийГруппы";
		МенеджерЗаписи.НазваниеПроцедуры = "ПроцедураДляВызова";
		ТекущиеДанные = Новый Структура();
		ТекущиеДанные.Вставить("КолВыполненныхИтераций", 1);
		ТекущиеДанные.Вставить("ОжидаемыйТипОтветаПользователя", "НомерГруппы");
		ТекущиеДанные.Вставить("НомерВыбраннойТелеграмГруппыСообщений", 0);
		ТекущиеДанные.Вставить("НазваниеПапки", "");

		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
		               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.Период КАК Период,
		               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.ТелеграмГруппаСообщений КАК ТелеграмГруппаСообщений
		               |ИЗ
		               |	РегистрСведений.ТелеграмГруппыСообщенийСостояние.СрезПоследних КАК ТелеграмГруппыСообщенийСостояниеСрезПоследних
		               |ГДЕ
		               |	НЕ ТелеграмГруппыСообщенийСостояниеСрезПоследних.Открыта
		               |	И ТелеграмГруппыСообщенийСостояниеСрезПоследних.ТелеграмГруппаСообщений.ТелеграмКонтакт = &ТелеграмКонтакт
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.ТелеграмГруппаСообщений.Дата УБЫВ";
		Запрос.УстановитьПараметр("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
		Выборка = Запрос.Выполнить().Выбрать();
				
		Текст = "Выберите группу:";
		
		Пока Выборка.Следующий() Цикл
			Текст = Текст + Символы.ПС + "/" + Формат(Выборка.ТелеграмГруппаСообщений.Номер, "ЧГ=0") + " " + Выборка.ТелеграмГруппаСообщений.Дата; 			
		КонецЦикла;
		
		 
		МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
		МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);		
		
		Сообщение = Новый Структура();
		Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
		Сообщение.Вставить("Текст", Текст);
		ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
		
	Иначе
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ТекущиеДанные = МенеджерЗаписи.ТекущиеДанные.Получить();
			ТекущиеДанные.КолВыполненныхИтераций = ТекущиеДанные.КолВыполненныхИтераций + 1;
			
		    Если ТекущиеДанные.ОжидаемыйТипОтветаПользователя = "НомерГруппы" Тогда //Пользователь должен прислать номер телеграм группы сообщений
				ТекущиеДанные.НомерВыбраннойТелеграмГруппыСообщений = Число(Сред(ТекстСообщения, 2));
				
				ТекущиеДанные.Вставить("ОжидаемыйТипОтветаПользователя", "НазваниеПапки");
				
				Сообщение = Новый Структура();
				Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
				Сообщение.Вставить("Текст", "Введите название каталога с компоновкой");
				ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
			ИначеЕсли ТекущиеДанные.ОжидаемыйТипОтветаПользователя = "НазваниеПапки" Тогда
				ТекущиеДанные.НазваниеПапки = ТекстСообщения;
				
				Текст = "Куда отправить скомпонованные данные:";
				Для Каждого Строка Из Справочники.Настройки.СписокКаталоговКомпоновки.ТаблицаНастроек Цикл
					Текст = Текст + Символы.ПС + "/" + Строка.Параметр;	
				КонецЦикла;
				ТекущиеДанные.Вставить("ОжидаемыйТипОтветаПользователя", "МестоНазначения");
				
				Сообщение = Новый Структура();
				Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
				Сообщение.Вставить("Текст", Текст);
				ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
			ИначеЕсли ТекущиеДанные.ОжидаемыйТипОтветаПользователя = "МестоНазначения" Тогда
				СтрокаНастройки = Справочники.Настройки.СписокКаталоговКомпоновки.ТаблицаНастроек.Найти(Сред(ТекстСообщения, 2));
				
				Если ЗначениеЗаполнено(СтрокаНастройки) Тогда // Выбран каталог из настроек
					//Отправим сообщение что начали
					Сообщение = Новый Структура();
					Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
					Сообщение.Вставить("Текст", "Операция начата");
					ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
					
					ПолныйПутьКЦелевомуКаталогу = СтрокаНастройки.Значение;		
					ОбрКомпоновки = Обработки.ТелеграмКомпоновкаСообщенийГруппы.Создать();
					ПолныйПутьКПапкеИсточника = ОбрКомпоновки.СкомпоноватьСообщенияГруппыЛинейно(Документы.ТелеграмГруппыСообщений.НайтиПоНомеру(ТекущиеДанные.НомерВыбраннойТелеграмГруппыСообщений), ТекущиеДанные.НазваниеПапки);
					ОбщегоНазначения.СкопироватьПереместитьКаталог(ПолныйПутьКПапкеИсточника, ПолныйПутьКЦелевомуКаталогу, Истина);
					
					// Отправим сообщение что закончили
					Сообщение = Новый Структура();
					Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
					Сообщение.Вставить("Текст", "Операция завершена. ИИ ""ТелеграмИИОбработкаСообщенийГруппы"" деактивирован.");
					ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
					
					//Это последняя операция ИИ, отключаем его и завершаем процедуру
					МенеджерЗаписи.Удалить();
					Возврат;
				КонецЕсли;
			
			КонецЕсли;
				
			МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
			МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
			МенеджерЗаписи.Записать(Истина);
		Иначе
			ЗаписьВЖурналОшибок("Обработки.ТелеграмИИОбработкаСообщенийГруппы", "МодульОбъекта", "Обработка пустого сообщения. Сообщение входящие=""" + СсылкаДокВхСообщение + """");	
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры
